app/Http/Livewire/HiringImmediately.php

select count(*) as aggregate from `job_posts` where `tag` = 3
---
    public function render()
    {
        if(!$this->fired) {
            $this->immediateJobPosts = JobPost::with(['company'])
                ->where('tag', JobPost::IMMEDIATE)
                ->inRandomOrder()
                ->paginate($this->perPage);