app/Http/Livewire/ListJobPost.php

    public function filteredJobPosts($filters = null){
        if($filters){
            dd(array_keys($filters));
        }
        $this->jobPosts = JobPost::with(['company'])
            ->paginate($this->perPage);
---
select * from `companies` where `companies`.`id` in (1)
select * from `job_posts` limit 5 offset 0
select count(*) as aggregate from `job_posts`

    public function render()
    {
        if(!$this->fired){
            $this->jobPosts = JobPost::with(['company'])
                ->paginate($this->perPage);
---
select * from `companies` where `companies`.`id` in (1)
select * from `job_posts` limit 5 offset 0
select count(*) as aggregate from `job_posts`