app/Http/Controllers/HomeController.php

    public function index(){
        $jobPosts = JobPost::with(['company'])
            ->paginate(5);

        $topCompanies = Company::with(['user'])->take(6)->get();
---
select * from `companies` where `companies`.`id` in (1)
select * from `job_posts` limit 5 offset 0
select count(*) as aggregate from `job_posts`
select * from `companies` limit 6
select * from `users` where `users`.`id` in (2)