app/Http/Controllers/JobPostController.php

select * from `companies` where `companies`.`id` in (1)
select * from `users` where `users`.`id` in (2)
---
    public function show(JobPost $jobPost){
        $jobPost->load(['company.user', 'location']);